[
 {
   "No": 0,
   "Company": "Example",
   "Project Title": "Monitoring solutions for cloud infrastructure",
   "Project Introduction": "Monitoring assessment of current cloud environments \n Onboarding and setting-up new monitoring solutions - Prometheus and Grafana (Prometheus is open-source systems monitoring and alerting toolkit that collect and store its metrics as time series data; Grafana is open-source visualization and analytics software. It allows to query, visualize, alert on, and explore your metrics no matter where they stored) \n Determine the metrics and establish targeted alerting \n Automate monitoring activities such as event-based responses, configuration changes, periodic health checks and timed reports.",
   "Project Outcomes & Deliverables": "With the move to hybrid and cloud environments, there is an imminent need for new analytics-based monitoring software that can provide full stack views into service availability and network performance – in real time. \n \n This project will onboard the centralized monitoring solutions for cloud environments in saving operation cost and enhance the system availability in dynamic hybrid and multi-cloud platform (Azure, AWS)",
   "Project Success Criteria": "N/A",
   "Technical and Professional Competencies & Skills required": "Basic program language: Bash/Powershell or Python \n \n Public Cloud: AWS \n Monitoring solutions \n OS: Window/Linux",
   "Project Description": "Bosch 1",
   "Academic Background": "SE, IT",
   "Student #": 3,
   "Interview required?": "N",
   "Multi teams allowed?": "",
   "Supervisor Name": "Mr. To Van Suol",
   "Position": "Engineering Manager",
   "Email": ""
 },
 {
   "No": 1,
   "Company": "Netcompany",
   "Project Title": "Netcompany Quiz",
   "Project Introduction": "The project is a mobile-based application with different game missions to be completed, to win presents from Netcompany. The students can join and play the game immediately by scanning a QR code and inputting their information. The game should start from a basic level and progress to harder levels, and with successful completion of missions, the participants can get different gifts from Netcompany. The easy tasks can be simply answering multiple-choice questions, taking photos, and checking in on social network. For challenging tasks, augmented reality (AR) technologies are applied to have the students run around the university campus, find missions, and complete the challenges.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n\nStudents should work on-site at Netcompany Office at least 1 working day/week for a Meeting with supervisors.",
   "Project Outcomes & Deliverables": "·        The application must be available on both Android and iOS .;l\n·        All MVP features must be delivered\n·        High code quality and unit test code coverage of 50%\n·        Minimalist application design with high usability\n·        The application should handle at least 50-100 concurrent users\n",
   "Project Success Criteria": "N/A",
   "Technical and Professional Competencies & Skills required": "\n1.        Programming skills: Mobile development:\n•        Mobile Client: React Native with TypeScript\n•        Backend: Springboot\n•        Database: PostgreSQL \n•        Build tool and dependency management: Gradle, npm \n•        Testing: You can use any type of testing technologies, suggested technologies are Jest, Spock, and JUnit.\n•        DevOps: Project configuration and CI/CD pipeline for project building and testing\n\n2.        Soft skills:\n•        Project management: Scrum/Agile methodology \n•        Professionalism: \no        Willing to learn new technologies and to be open to discussion \no        Meetings are scheduled ahead, and an agenda is provided\n",
   "Project Description": "Netcompany 1.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Ms Vu Thuy Chi Lan",
   "Position": "Talent Acquisition Consultant",
   "Email": ""
 },
 {
   "No": 2,
   "Company": "Netcompany",
   "Project Title": "Netcompany Social Suggestion",
   "Project Introduction": "As we have a strong focus on social activities in Netcompany, as well as a number of expats working in offices in other countries, it would be very beneficial for us to have a solution allowing for colleagues to suggest good places in the different cities where we reside. The solution should be web-based and work well on both desktop and mobile.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n\nStudents should work on-site at Netcompany Office at least 1 working day/week for a Meeting with supervisors. ",
   "Project Outcomes & Deliverables": "\n•        Registering recommendations in several categories (Sight, Restaurants, Bars, Entertainment, Team events) along with a comment and indication of price level. Optionally it should be possible to upload pictures\no        Extension: “Register this place”, making it easy to register a location when you are physically there. Based on GPS location, the venue could be suggested on a list based on Google Maps, allowing the user to simply select it, select the category and write a comment\n•        Viewing recommended locations on a map, allowing for filtering by location category, price and so forth\no        Extension: Integration to Google Maps, to also allow for filtering by opening hours\n•        Extension: Planning of team events\no        Suggested locations for team event, dinner and drinks\no        Possibility to search for locations in close proximity, and filter by type and price indication\n•        Itinerary planner \no        Possibility to save your personal itineraries, selecting different locations and adding them to a list. This allows the user to plan visits to a number of places\no        Extension: Automatic route planner, optimizing the itinerary for shortest and most efficient visit to a number of locations. It should be able to override the order manually, based on personal preference\n\n",
   "Project Success Criteria": "N/A",
   "Technical and Professional Competencies & Skills required": "•        Analysis and documentation\n•        Mobile development, web development.\n•        Testing and auto-deployment.\n•        Database control\n•        API integration\n",
   "Project Description": "Netcompany 2.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Ms Vu Thuy Chi Lan",
   "Position": "Talent Acquisition Consultant",
   "Email": ""
 },
 {
   "No": 3,
   "Company": "Netcompany",
   "Project Title": "Netcompany Office Tool",
   "Project Introduction": "The idea is to build a mobile web app or mobile application, to assist Netcompany employees in the daily “life” in our various offices.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n\nStudents should work on-site at Netcompany Office at least 1 working day/week for a Meeting with supervisors. ",
   "Project Outcomes & Deliverables": "The solution will should include the following:\n•        A user-friendly UI\n•        Integration to Netcompany’s internal SharePoint based system (called Toolkit), used by our Office function\no        Extract and display this week’s lunch menu\no        Send suggestions for changes in the office\no        Report problems in the office, and attach pictures if necessary\n•        Option for the Office function to set up surveys that the employees can answer, such as “rate the lunch” and so on\n•        Extension: “Find my colleague” function\no        Search by name or initials, and based on data from the Office Toolkit, show the correct desk on a map of the office\no        Possibility of being guided to the desk using AR\n•        Extension: “Find meeting room” function\no        Search for meeting room, and be guided to the correct location through a map or possibly using AR\no        Could be extended to show the nearest available meeting room\n",
   "Project Success Criteria": "N/A",
   "Technical and Professional Competencies & Skills required": "•        Analysis and documentation\n•        Mobile development, web development.\n•        Testing and auto-deployment.\n•        Database control\n•        API integration\n",
   "Project Description": "Netcompany 3.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Ms Vu Thuy Chi Lan",
   "Position": "Talent Acquisition Consultant",
   "Email": ""
 },
 {
   "No": 4,
   "Company": "Netcompany",
   "Project Title": "Netcompany tournament organizer",
   "Project Introduction": "Netcompany often runs various tournaments with both internal and external participants. This can be for sports activities such as football, ping pong or foosball, or employer branding activities such as gaming competitions or programming challenges.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n\nStudents should work on-site at Netcompany Office at least 1 working day/week for a Meeting with supervisors. ",
   "Project Outcomes & Deliverables": "To facilitate the running of different tournaments, we need a tournament organizer tool. Features of the tool should include:\n•        Web-based admin UI, allowing the configuration and running of tournaments, including:\no        Teams and participants\no        Tournament structure\no        Number of rounds, scoring and so on\no        Starting and stopping the running of the tournament\no        Entering results, to make the tournament move forward\no        Reminder email\n•        Results dashboard, showing the current standing of the tournament. This should be graphically appealing and easy to style for the various events. Animations when matches start and end are a plus\no        Current matches\no        Upcoming matches\no        Results of finished matches\no        Ranking and scores\no        Statistics\n•        Extension:\no        Livestream: Webpart or other solution that can be integrated with Facebook, to livestream the results of the tournament on the Netcompany Vietnam Facebook page\no        Calculation of the tournament setup: Based on the configured teams and participants, as well as the rules of the tournament, the solution can automatically determine the tournament structure and set up the tournament, making it ready to be run\n",
   "Project Success Criteria": "N/A",
   "Technical and Professional Competencies & Skills required": "•        Analysis and documentation\n•        Mobile development, web development.\n•        Testing and auto-deployment.\n•        Database control\n•        API integration\n",
   "Project Description": "Netcompany 4.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Ms Vu Thuy Chi Lan",
   "Position": "Talent Acquisition Consultant",
   "Email": ""
 },
 {
   "No": 5,
   "Company": "Centre for Mindfulness ",
   "Project Title": "Mindfulness App on Android / iOS platform for Children with Attention-Deficit / Hyperactivity Disorder (ADHD) ",
   "Project Introduction": "This project will focus on developing an Android/iOS app that provides guided mindfulness practices and activities targeted at children with ADHD.  The app should be bilingual (English and Vietnamese).  The aim of the app is to be able to show improvement in the management of symptoms after completing all practices and activities as prescribed in the app.  The aim of the company is to make this app available to children with ADHD worldwide.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "Produce a bilingual app on Android / iOS platform that fully meets the specification as listed by Centre for Mindfulness. ",
   "Project Success Criteria": "\n\nUpon completion, the app will be shared with a group of 50 people from all over the world, ranging from psychologists, teachers, school leaders, ADHD experts, parents, etc.  They will be completing a survey form and the app is deemed a success if 80% of the respondents rate the app as “Good” and “Excellent”. ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nProgramming, Mobile development (android/ios), Software Engineering skills, Cross platform mobile development OR android & iOS development \n\nSelf-driven, team-player, resilient and willing to keep trying  ",
   "Project Description": "Centre for Mindfulness.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Mr Albert Tiong",
   "Position": "Director",
   "Email": ""
 },
 {
   "No": 6,
   "Company": "BDOOP",
   "Project Title": "DEVELOPING ARTIFICIAL INTELLIGENCE APPLICATION FOR AUTOMATED INVOICE PROCESSING",
   "Project Introduction": "For those companies that process invoices manually, include paper or electronic invoices, the accountant need to contact other departments to get information and then compare it to the invoices. If the invoice is valid, the accountant will enter information into the accounting software and must ensure that all the information must be absolutely accurate so that the enterprise does not make any mistakes with the invoice information when Department of Taxation inspects that enterprise.\nDeveloping an AI application to process automatically invoice plays an important role in this scenario. The benefit is not only speeding up the working process but also limiting unexpected mistakes during data entry.\nThe project will include two main tasks:\n1. Developing AI model to extract information in invoices received from email.\n2. Integrating with ERP system by importing the extracted data to ERP system via API.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "1. Release AI Model API for extract data from invoice email.\n2. Create web application to visualize the result.\n3. If can, try to integrate with current ERP system to push extracted data to the system via API.",
   "Project Success Criteria": "1. Success in automatically collecting and extracting data from invoice email and download its attachment.\n2. Accuracy of extracted data compared with data from enterprise portal must be over 90% (achievable based on testing data)",
   "Technical and Professional Competencies & Skills required": "Required:\nPython, machine learning, deep learning\nResearch, Reporting, Teamwork.\nPreferable:\nSystem Engineering skills, Software Engineering skills, Data Science skills would be useful but not required since they can be learned on the job. Git would be a very useful skill to have.",
   "Project Description": "BDOOP.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Mr Ly Quang Vu",
   "Position": "Team Leader",
   "Email": ""
 },
 {
   "No": 7,
   "Company": "ABB",
   "Project Title": "Mixed Reality (MR) Robot Control with ABB Robot",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop the MR application for robot control on the Microsoft MR Headset – HoloLens 2\n2. Combine with ABB robots to build the system for testing the application\n3. Build the virtual robot station on the MR headset to virtualize the working area of the robot on the customer sites\n4. Study the communication technique from ABB and apply it for teleoperation with the built system\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time\n2. A real robot station and system with all functions are successfully built\n3. System specification documentation",
   "Project Success Criteria": "A system must produce a good performance in MR robot control (define later), with real-time control and avoid unsafety behaviours.",
   "Technical and Professional Competencies & Skills required": "Required:\n− Unity engine, Unreal engine\n− Programming skills (C#, XAML, Java, etc.)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Network communication\n− Mechatronics system and electrical skills\nPreferable:\nThe geometry of space, R&D skills, Immersive technology interest, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#1_MR_Robot_Control.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 3,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Hong Dang Xuan\n",
   "Position": "ABB Robotics Technical Consultant Manager",
   "Email": ""
 },
 {
   "No": 8,
   "Company": "ABB",
   "Project Title": "Virtual Reality (VR) Robot Control with ABB Robot",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop the VR application for robot control on the HTC Vive Headset\n2. Combine with ABB robots to build the system for testing the application\n3. Develop the robot station vision on the VR headset to virtualize the working area of the robot\n4. Study the communication technique from ABB and apply for teleoperation via the Internet with the built system\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time\n2. A real robot station and system with all functions are successfully built\n3. System specification documentation",
   "Project Success Criteria": "A system must produce a good performance in MR robot control (define later), with real-time control and avoid unsafety behaviours.",
   "Technical and Professional Competencies & Skills required": "Required:\n− Unity engine, Unreal engine\n− Programming skills (C#, XAML, Java, etc.)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Network communication\n− Mechatronics system and electrical skills\nPreferable:\nThe geometry of space, R&D skills, Immersive technology interest, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#2_VR_Robot_Control.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 9,
   "Company": "ABB",
   "Project Title": "Pick & Place Application with ABB IRB 360 FlexPicker® robot (HMI)",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop the UI application to control and monitor robot system.\n2. Combine with ABB robots to build the system for testing the application.\n3. Study the communication technique from ABB and interface with robot using robot web service.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time.\n2. A real robot station and system with all functions are successfully built.\n3. System specification documentation",
   "Project Success Criteria": "A system must produce a good performance in UI application, with real-time control and monitoring as well as avoid unsafety behaviours.",
   "Technical and Professional Competencies & Skills required": "Required:\n− UI design\n− Programming skills (C#, XAML, etc.)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Network communication\n− Mechatronics system and electrical skills\nPreferable:\nThe geometry of space, R&D skills, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#3_Pick_Place_360_(HMI).pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 10,
   "Company": "ABB",
   "Project Title": "ROBOT SMART HMI FOR PACKING APPLICATION",
   "Project Introduction": "This project will focus on designing and building the smart HMI for packing application in ABB robot Omnicore \nplatform. The main tasks are:\n1. Develop the UI application on a touch screen to monitor system in robot HMI.\n2. Develop the UI that help operator easy to change product and the way products are arranged.\n3. Combine with ABB robots to build the system for testing the application\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. The robot HMI have monitor function and UI for easy to change product and the way products are \narranged.\n2. A simulation station with all functions are successfully built.\n3. A real robot station and system with all functions are successfully built.\n4. System specification documentation",
   "Project Success Criteria": "A system must produce a good performance in recognising part and pick and place tasks (define later), with real-time control and avoid unsafety behaviours.",
   "Technical and Professional Competencies & Skills required": "Required:\n− UI design\n− Programming skills (C#, HTML, etc.)\n− Network communication\nPreferable:\n− The geometry of space, R&D skills, Electrical skills, Problem-solving, and Robotics skills\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)",
   "Project Description": "ABB_Project#4_Smart_HMI_For_Packing_Application.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 11,
   "Company": "ABB",
   "Project Title": "Pick & Place Application with ABB IRB 360 FlexPicker® robot (RWS & Tool Design)\n\nABB ROBOT MACHINING INTERFACE",
   "Project Introduction": "This project target to machine robotics application with ABB robot.\nThe main tasks are as follows:\n1. Build software to help operator can use robots like the CNC machine. This software can control and \nmonitor the activities of the robot and equipment.\n2. Build a robot program can read the file from CAM software (like G-Code) by RAPID code (ABB robots \nlanguage).\n3. Design an easy-of-use interface for operator (UI-UX).\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "Provide complete solutions from software to mechanical solutions:\n1. A simulation station in ABB RobotStudio software and CAM Software.\n2. The software can manages the steps of the machining process on the robot same as the CAM software.\n3. Program the robot to read the output file from CAM Software (like G-code).\n4. The software can control and monitor the activities of the system to meet the requirements with a \nfriendly and easy-to-use interface (UI-UX).",
   "Project Success Criteria": ". Fully understanding the function and principle of the designed system. (Any ideas to improve/innovate \nthe station are plus points)\n2. The user interface is designed with full function and UI-UX.\n3. Logical and simulation robot and system on Robot Studio software.\n4. The software can work with the features of communication, data recording, data processing, and operating \ncontrol of the device.",
   "Technical and Professional Competencies & Skills required": "Required:\n• Engineering background\n• Programming with C/C++/C#\n• Software design skill is strengths: UI-UX",
   "Project Description": "ABB_Project#5_Machining_Interface.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 12,
   "Company": "ABB",
   "Project Title": "3D Objects Rendering From 2D Images",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop the virtual environment rendering application for PC.\n2. Develop the robot control application in both simulation and actual robot.\n3. Combine virtual environment and robot control to create a digital twin of the workstation.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time.\n2. A real robot station or simulation and system with all functions are successfully built.\n3. System specification documentation.",
   "Project Success Criteria": "A system must produce accurate and visual virtual environment (criteria define later), with real-time rendering and robot control.",
   "Technical and Professional Competencies & Skills required": "Required:\n− Image and video processing (OpenCV, FFmpeg, etc.)\n− Programming skills (C#, XAML, Java , Python, etc.)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Robotics programming (Robot studio, ROS, etc.)\n− Mechatronics system and electrical skills\nPreferable:\nThe geometry of space, R&D skills, Computer Vision technology interest, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#6_3D_Objects_Rendering.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 13,
   "Company": "ABB",
   "Project Title": "Mixed case palletizing system with ABB robot",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop the VR application for robot control on the HTC Vive Headset\n2. Combine with ABB robots to build the system for testing the application\n3. Develop the robot station vision on the VR headset to virtualize the working area of the robot\n4. Study the communication technique from ABB and apply for teleoperation via the Internet with the built system.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time\n2. A real robot station and system with all functions are successfully built\n3. System specification documentation",
   "Project Success Criteria": "A system must produce a good performance in MR robot control (define later), with real-time control and avoid unsafety behaviours.",
   "Technical and Professional Competencies & Skills required": "Required:\n− Unity engine, Unreal engine\n− Programming skills (C#, XAML, Java, etc.)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Network communication\n− Mechatronics system and electrical skills\nPreferable:\nThe geometry of space, R&D skills, Immersive technology interest, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#7_Mixed_Case_Palletizing_System.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 14,
   "Company": "ABB",
   "Project Title": "Design and Simulation the asembly station with ABB robots",
   "Project Introduction": "This project will focus on designing and building the system application with the ABB robot. The main tasks are:\n1. Develop an application to receive the outcome requirements of an assembly/production line, calculate and generate best setting options for the line. Then communicate and apply the calculated settings to a virtual assembly/production line\n2. Develop a function to calculate the efficiency, downtime, etc based on the current settings of an existing assembly/production line. Then recommend suitable adjustments to improve the line’s performance\n3. Implement ABB robots to build a virtual assembly/production line for testing.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "The key and specific deliverables of the project:\n1. Establish the project plan for this project and deliverable time\n2. A virtual assembly/production line using ABB robots and an application with all successfully built functions\n3. System specification documentation",
   "Project Success Criteria": "The Application must be able to evaluate and generate the best solutions for the assembly/production line and then be able to apply those settings to the virtual line in RobotStudio",
   "Technical and Professional Competencies & Skills required": "Required:\n− RobotStudio\n− Programming skills (preferred C#)\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.)\n− Mechatronics system and electrical skills\n− Production/Assembly line knowledge\nPreferable:\nThe geometry of space, R&D skills, Immersive technology interest, Electrical skills, Problem-solving, and Robotics skills",
   "Project Description": "ABB_Project#8_Design_Application_Assist_Building_Efficient_Assembly_Production_Line.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 15,
   "Company": "ABB",
   "Project Title": "Factors affecting robot accuracy in robot-vision applications and solutions",
   "Project Introduction": "The project focuses on researching the operating principle of the robot-vision system and determines the factors affecting the accuracy of the system. We would like students to work on a deep understanding of how the system works, and then develop solutions to improve the accuracy of the application. The main tasks are as follows:\n1. Researching the operating principle of the robot-vision system.\n2. Determines the factors affecting the accuracy of the system.\n3. Propose solutions to improve the accuracy of the application.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nThe company refer the project team to work on-site and register the time slot for using the ABB facilities \n(such as equipment, robots, tools, etc)",
   "Project Outcomes & Deliverables": "1. Complete ABB robot basic program in alignment application using Integrated vision (ABB product)\n2. Show out the working principle of the robot-vision in alignment application\n3. Point out factor affecting the accuracy of robot-vision system in alignment application\n4. Verify the solution to improve the accuracy of the system",
   "Project Success Criteria": "1. Describe in detail the working principle of the robot-vision system\n2. Determine the exact factors that affect the accuracy of the system\n3. Offer at least 3 effective solutions that improve accuracy up to 0.05 mm",
   "Technical and Professional Competencies & Skills required": "Required:\n− Programming (C, C#, Python, HTML, etc.)\n− Camera Vision, Robotics\n− Network communication\nPreferable:\n− Computer vision\n− 3D design application (SolidWorks, AutoCAD, Blender, etc.",
   "Project Description": "ABB_Project#9_Factors affecting robot accuracy in robot-vision applications and solutions.pdf",
   "Academic Background": "BH073, BH123, BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Thai Truong Dinh\n",
   "Position": "ABB Robotics Specialist Engineer",
   "Email": ""
 },
 {
   "No": 16,
   "Company": "Faraday",
   "Project Title": "Application-Specific Integrated Circuit (ASIC) Development and Practical Application \n- ASIC SRAM Testchip Development  ",
   "Project Introduction": "In this project, students will be introduced to the Full ASIC Development Flow from Netlist to GDSII, using latest EDA tools from Cadence and Synopsys.  \n \n\nThe goal is to let students better understand the working requirements of ASIC Development so that they can make a better career choice after graduation. \n \nStudents will implement two SRAM Testchip on both UMC 22nm and 55nm. Key concepts such as Design-For-Test (DFT), Static Timing Analysis (STA), Floor planning, Placement, Clock-Tree-Synthesis (CTS), Routing, Timing Closure and IR Drop analysis will introduced to students.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n- Students are required to spend up to 20 hours / week on-site",
   "Project Outcomes & Deliverables": "Deliverables for 22nm vs 55nm SRAM Testchip: \n\n \n\na. Compare Performance, Power and Area key metrics in % \nb. Link the differences from IC Design consideration to Foundry manufacturing limitation",
   "Project Success Criteria": "Students will be evaluated based on 3 broad areas, namely Technical Evaluation, Communications and Soft Skills. In addition, there will be a presentation at end of area to assess students’ progress and understanding.  \n \n\nFor Technical Evaluation  \n\nDepth, Breath of Understanding (20%) \n\nSlide Quality (20%) \n\nCommunication  \n\nEnglish Presentation (20%) \n\nConclusion (10%) \n\nSoft Skills \n\nTeamwork (10%) \n\nPro-activeness (10%) \n\nDiscipline, Attendance (10%) ",
   "Technical and Professional Competencies & Skills required": "\n\nVerilog Basic \n\nSome knowledge in using any 1 of the following programming language \n- C or C++ / Assembly / Python / TCL / Perl  \n\nLinux ",
   "Project Description": "Faraday 1_ ASIC Integrated Circuit Development Faraday.docx",
   "Academic Background": "BH073, BH123",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Le Nguyen Chuan \n",
   "Position": "Project Supervisor",
   "Email": ""
 },
 {
   "No": 17,
   "Company": "Faraday",
   "Project Title": "Application-Specific Integrated Circuit (ASIC) Development and Practical Application \n- RTL Verification Methodology on USB Subsystem ",
   "Project Introduction": "\n\nIn this project, students will be introduced to the full flow of RTL Verification in advanced process node using latest EDA tools from Cadence and Synopsys.  \n \n\nThe goal is to let students better understand the working requirements of ASIC Development so that they can make a better career choice after graduation. \n \nStudents will be introduced to verification methodology such as UVM and be expected to work on USB2.0 industry standard IP. If students’ progress are ahead of schedule, USB3.0 will be introduced in later phase. \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n- Students are required to spend up to 20 hours / week on-site",
   "Project Outcomes & Deliverables": "Deliverables for RTL Verification on USB2.0 Subsystem: \n \na. UVM Simulation Environment \nb. >100 Test vectors  \nc. Verification report with 100% Test Coverage \n\n ",
   "Project Success Criteria": "Students will be evaluated based on 3 broad areas, namely Technical Evaluation, Communications and Soft Skills. In addition, there will be a presentation at end of area to assess students’ progress and understanding.  \n \n\nFor Technical Evaluation  \n\nDepth, Breath of Understanding (20%) \n\nSlide Quality (20%) \n\nCommunication  \n\nEnglish Presentation (20%) \n\nConclusion (10%) \n\nSoft Skills \n\nTeamwork (10%) \n\nPro-activeness (10%) \n\nDiscipline, Attendance (10%) ",
   "Technical and Professional Competencies & Skills required": "Verilog Basic \n\nSome knowledge in using any 1 of the following programming language \n- C or C++ / Assembly / Python / TCL / Perl  \n\nLinux ",
   "Project Description": "Faraday 2_ RTL Verification Faraday.docx",
   "Academic Background": "BH073, BH123",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Nguyen Trong Nam \n",
   "Position": "Project Supervisor",
   "Email": ""
 },
 {
   "No": 18,
   "Company": "OUCRU",
   "Project Title": "Modelling infectious disease transmission with R",
   "Project Introduction": "This project will focus on developing a software in R that use serological data and social contact data to model infectious disease transmission. We would like students to translate provided mathematical modelling methods into easy-to-use and efficient tools written in R that can be widely used by the scientific modelling community. Serological survey is quantifying the proportion of people positive for a specific antibody, which often means they have been exposed to a pathogen or a vaccine in the past and could also mean that they are immune to this pathogen at present. Social contact data inform about the interactions between individuals in a population. A notable example is the Data for Good (https://dataforgood.facebook.com) initiative launched by Facebook (Meta) in 2018 which informs real-time population movements.\n\nThe first version of this package will be based on methods published in the book “Modeling Infectious Disease Parameters Based on Serological and Social Contact Data – A Modern Statistical Perspective” (Hens et al. 2012 Springer, https://link.springer.com/book/10.1007/978-1-4614-4072-7). An initial version of the package is already set up. The main tasks are as follows:\n1.        Design, develop, test, and maintain R packages for modelling infectious disease transmission using serological data and social contact data\n2.        Prepare clear and comprehensive documentation to guide users on how to use the R packages, with tutorials on example datasets\n3.        Develop a website to host R packages documentation, provide interactive and responsive visualizations as well as give users the ability to test out the package.\n4.        Publish the R packages on open-source repositories such as CRAN, rOpenSci\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "1. R packages that adhere to best practices in software development, with a focus on code quality, maintainability, and reusability, that achieve unit test coverage of at least 90% and implement CI/CD (continuous integration/continuous deployment)\n2. Comprehensive documentation for the R packages, including user guides with step-by-step instructions and examples of usage, technical documentation that describes the package architecture, data formats, algorithms used and provide tutorials on example datasets\n3. A maintainable website that hosts the R packages documentation, provide interactive and responsive visualizations, as well as give users the ability to test out the package online.\n",
   "Project Success Criteria": "\n1.        The first version that cover all disease transmission modelling methods in the Hens et al. (2012) book, unit test coverage of above 90%, CI/CD implemented, with detailed documentation\n2.        Package published on CRAN repository (https://cran.r-project.org/)\n3.        Package published on rOpenSci (https://ropensci.org/)\n4.        Website for users to test out the package with visualizations\n",
   "Technical and Professional Competencies & Skills required": "Required:\nProgramming, Software Project Management, Software Development\nPreferable:\nSoftware Engineering skills, Experience with Agile and other software project management frameworks, Web Development\nIdeal:\nStrong programming skills in R, Git/GitHub, Ability to new learn things, Mathematical Modelling though this is not a strong requirement and can be taught by supervisors, Research\n",
   "Project Description": "OUCRU No. 1_Proposal_MathModelling.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Dr Ong Phuc Thinh",
   "Position": "Researcher",
   "Email": ""
 },
 {
   "No": 19,
   "Company": "OUCRU",
   "Project Title": "Agent-based modelling with R: an R package that interface with the GAMA simulation platform ",
   "Project Introduction": "Context: agent-based models (ABM) are computational models based on the definition of autonomous agents characterized by a set of properties and a set of behaviours that depend on the environment of the agent that may include some other agents. In principle there is no limit to the level of detail and complexity that can be captured by such a modelling framework. The computational power to run these models is the only limit. One of the many interests of ABM is that there are micro-scale models that allows to understand emerging properties at macro scale. Typical examples of such emerging properties are traffic jams, fish schools and bird flocks collective behaviour, crowds behaviours, herd immunity, etc… Many such models have been developed recently to address the COVID-19 pandemic. \n\nBackground: because of the potential high level of detail of the ABM, their development often requires a high level of expertise in computer programming, especially in compiled and object-oriented languages, which often represent a huge hurdle for potential users. Over the past decades, a number of tools and platform have been developed going from powerful low-level libraries (e.g. Repast Simphony) to more user-friendly options (e.g. NetLogo, essentially developed for teaching and thus rather limited both in possibilities and performance). One platform stands out by combining both great user interface (including a dedicated language) and performance (fully parallelized): the GAMA platform, developed from Vietnam since 2017. One aspect that is not offered by any of these tools yet, is the design and analysis of in silico experiments based on these ABM simulations. The R statistical and programming language has become over the past decade the de facto language for data analysis, together with Python and is more predominantly used in applied discipline related to statistics more than engineering such as the health and environmental sciences in general. As of today, there are very limited options to run ABM simulations directly from R. Those are the use of some of the OO paradigms available in the R language (but not efficient) and the use of one of these R packages: rrepast (an interface to Repast Simphony), RNetLogo (an interface to NetLogo) and two more limited and specialize packages: villager and abmR. There is currently no R interface to GAMA, despite GAMA becoming one of the ABM platforms more and more used these days. \n\nGoal: to develop an R package that interface with the GAMA simulation platform and offers tools to design and analyse simulations experiments. \n\nObjectives: \nA version 1.0.0 of the package \nA unit testing code coverage above 90% \nA continuous integration using the GitHub Actions \nTest and include in visualization tool all example/toy models offered by GAMA developers \nA full documentation, including “vignettes” (i.e. cases study examples) \nAn accompanying website for the package developed with the package pkgdown and hosted on GitHub \nA web-based or app-based accompanying visualization tool \nA submission of the package to the CRAN repository \nA submission of the package to the rOpenSci organization \nA submission of an article documenting the package to the Journal of Statistical Softwares\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "\n\n1. A version 1.0.0 of the package with full documentation and unit testing code coverage above 90% \n\n2. A website of the package \n\n3. An article presenting the package \n\n4. A visualization tool  ",
   "Project Success Criteria": "\n\n1. Accuracy: comparable results obtained with differential equations of the simple deterministic epidemiological SIR model developed using the deSolve R package \n\n2. Accuracy: comparable results obtained with the Gillespie algorithm of the simple stochastic epidemiological SIR model developed using the adaptivetau R package \n\n3. Performance: similar running time of a GAMA model run directly from GAMA and through the R interface \n\n4. Performance: good handling of multiple simulations on several threads ",
   "Technical and Professional Competencies & Skills required": "\n\nRequired: \n\nProgramming, Git and GitHub \n\nPreferable: \n\nR, Java, Agent-based modelling, Software Engineering skills, Unit testing \n\nIdeal: \n\nMath skills, Web development ",
   "Project Description": "OUCRU No. 2_R_GAMA.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Dr Ong Phuc Thinh",
   "Position": "Researcher",
   "Email": ""
 },
 {
   "No": 20,
   "Company": "OUCRU",
   "Project Title": "ChatGPT-based portal for public healthcare knowledge and guidance related to dengue ",
   "Project Introduction": "Coping with public health emergency such as a dengue outbreak, it is crucial to have a reliable and user-friendly information platform. Such a platform is crucial for disease prevention, public health preparedness, and countering misinformation. However, developing such a platform is challenging due to several reasons such as required experts with specialized knowledge to curate reliable and comprehensible content, the information must be updated frequently to reflect the rapidly changing circumstances, the accessibility by the general public. In this project, we develop a healthcare chatbot, based on the language model behind the successful ChatGPT, to provide accessible and credible healthcare knowledge and medical guidance to citizen, focusing on dengue and healthcare issue related to dengue. This project requires programming skills for data processing and analytics, data visualization and web development. Participants will also explore a range of available OpenAI APIs in order to further fine tune a chatbot for healthcare service. \n\nThe projects can be completed in several stage of research and development (R&D). The main tasks are as follows: \n\nDesign, develop, and test a web-based information portal and a simple Vietnamese chatbot. \n\nExplore ChatGPT and its capacity in providing general healthcare knowledge and information. \n\nPrepare dengue healthcare knowledge as structured data to further fine tune a OpenAI model. Learn to access and fine tune an existing OpenAI model for the healthcare consultation tasks. \n\nDevelop, embed and deploy the chatbot on the public health information portal. \n\nTest, evaluate, and report on the performance of the information portal and the chatbot. This step might involve some public survey tasks.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "1. A maintainable web-based information portal that is accessible by the public. \n\n2. A chatbot that can provide credible healthcare knowledge and medical guidance to citizen, focusing on dengue and healthcare issue related to dengue. The success of this module is the proven accuracy of the information and guidance provided by the chatbot. \n\n3. Documentation and report on the development, maintenance, functions, and evaluation of the portal and its service. ",
   "Project Success Criteria": "\n\nAccessible and well-designed website as a healthcare information portal \n\nFunctional chatbot that can interact and respond to questions and queries in Vietnamese \n\nInformation and healthcare guidance provided by the chatbot meets certain level of accuracy (to be defined in the project by medical practitioners)  ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nPython Programming, Software Project Management, Software Development \n\nPreferable: \n\nSoftware Engineering skills, Experience with Agile and other software project management frameworks, Web Development, Data processing analytics skills \n\nIdeal: \n\nStrong programming skills in Python, Git/GitHub, Ability to new learn things, Data Analytics though this is not a strong requirement and can be taught by supervisors, Research ",
   "Project Description": "OUCRU No.3_ChatGPT.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Associate Professor Sophie Yacoub ",
   "Position": "Researcher",
   "Email": ""
 },
 {
   "No": 21,
   "Company": "Phuong Hai",
   "Project Title": "AI for agriculture: prediction of vegetable prices using Machine Learning and AI",
   "Project Introduction": "Vietnam is one of the top agricultural exporters. However, farmers and agriculture companies still struggle with\nrecurrent problems such as \"crops gain, low prices; high-priced crops loss.\" Precise prediction of agriculture\nprices is important to avoid these problems, help farmers increase their incomes, reduce poverty, and achieve\nsustainability.\nPage 2 of 3\nWith technological advancements, many big companies, especially in the West, have gradually applied\nAgriculture 4.0 to tackle the problem of price prediction. However, Vietnam lags behind significantly in this\naspect. Applying advanced technologies such as AI and machine learning promises to improve the status quo.\nPhuong Hai JSC is starting its own farm and this AI system would help the company in its production.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "The scope of the project is limited in vegetable prices prediction, focusing mainly on cold-weather products such\nas tomatoes, green bean, okra, carrot, and potatoes.",
   "Project Success Criteria": "The final outcome of the project should be a system that allows prediction of vegetable prices. It should contain\na website for end users to use, visualization of prediction results, justification of the results. Database, backend,\nfrontend, and the model should be deployed online. More specifically, the system should allow:\n1. Precision of prediction is between 80-90%\n2. A functioning system deployed online",
   "Technical and Professional Competencies & Skills required": "Required:\nMachine learning, Web Programming\nPreferable:\nMachine learning, NodeJS, ReactJS\nIdeal:\nMachine learning, Web Programming, Experience with Machine Learning in vegetable price prediction",
   "Project Description": "Phuong Hai No 1_AI4Agriculture.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Nguyen Manh Hien",
   "Position": "Director",
   "Email": ""
 },
 {
   "No": 22,
   "Company": "Phuong Hai",
   "Project Title": "Build a complete Manufacturing Management System",
   "Project Introduction": "Manufacturing management software is a system designed to help manufacturing companies optimize their\nproduction processes and operations. This software enables companies to track and manage production schedules,\ninventory levels, labor resources, and other critical aspects of the manufacturing process in real-time. By\nproviding real-time data and analytics, manufacturing management software enables companies to identify and\naddress production issues quickly and efficiently, reducing downtime and increasing overall productivity.\nPage 2 of 4\nAdditionally, this software can help streamline quality control and compliance processes, enabling companies to\nmaintain consistent levels of product quality and meet regulatory requirements. Overall, manufacturing\nmanagement software can help companies improve their manufacturing operations, reduce costs, and increase\nefficiency, making it a critical tool for modern manufacturing companies.\nPhuonghai JSC as a leading lab furniture producer needs a software to improve its manufacturing process.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "The expected outcome of the project is to build a system that meets requirements of Phuonghai JSC.\nManufacturing management software typically includes a wide range of features and capabilities to help\nmanufacturing companies optimize their production processes. Some of the key features of manufacturing\nmanagement software include:\nProduction planning and scheduling: The software helps in managing the production planning process, including\nscheduling of production runs, managing resources, and monitoring production progress.\nInventory management: This feature helps in tracking the inventory levels of raw materials, components, and\nfinished goods, and automating the procurement process.\nQuality control and compliance: This feature enables companies to maintain consistent product quality and ensure\ncompliance with regulatory requirements.\nEquipment maintenance: The software helps in managing equipment maintenance schedules and tracking\nmaintenance activities.\nSupply chain management: This feature helps in managing the entire supply chain, including procurement,\nlogistics, and distribution.\nReal-time data and analytics: The software provides real-time data and analytics to help manufacturing companies\nmake informed decisions and optimize their production processes.\nResource management: This feature helps in managing labor resources, including scheduling and tracking\nemployee time and attendance.\nCost tracking and analysis: The software provides detailed cost tracking and analysis, enabling companies to\nidentify areas for cost reduction and improve profitability.\nReporting and dashboards: The software provides comprehensive reporting and customizable dashboards to help\nmanufacturing companies track and monitor key performance metrics.\nStudents can refer to this link to see how a real life system works:\nhttps://www.odoo.com/app/manufacturing",
   "Project Success Criteria": "The system should be working to be fully used to support the manufacturing processes at Phuonghai JSC. Criteria\nof success should involve:\n1. A functioning system deployed online\n2. Can meet up to 90% of the requirements at Phuonghai JSC\n3. Accuracy of calculation of socks, material planning\n4. No critical bugs, less than 5 major bugs and less than 10 minor bugs",
   "Technical and Professional Competencies & Skills required": "Required:\nWeb Programming, Database\nPreferable:\nNodeJS, ReactJS, PostgreSQL\nIdeal:\nExperiences with ERP or CRM system",
   "Project Description": "Phuong Hai No 2_OdooManufacturing.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Nguyen Manh Hien",
   "Position": "Director",
   "Email": ""
 },
 {
   "No": 23,
   "Company": "Deskimo",
   "Project Title": "Meeting room calendar display ",
   "Project Introduction": "We're excited to invite talented students to join our team and work on an innovative project! Our main objective is to develop a high-quality React Native app that runs smoothly on Android and IOS platforms, connected to Deskimo's WMS to retrieve real-time information about meeting room availability and display it on the app's user-friendly interface. \n\nAs part of this project, we'll be creating an app with must-have features like a calendar of availability and QR code booking. Additionally, if time and resources allow, we'll work on an optional battery-effective hardware improvement with a liquid ink display that can last for at least 2 years. \n\n\nBy joining our team, you'll have the opportunity to showcase your skills and work on a project that offers a practical solution to businesses. We're committed to delivering high-quality results and are looking for students who share our passion for innovation and excellence. Apply now and let's create an app that revolutionizes the way people book meeting rooms!\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \nWhile we don’t expect them full-time I would expect to at least meet in the office 2 days per week ",
   "Project Outcomes & Deliverables": "A tablet-compatible mobile application with full functionality ",
   "Project Success Criteria": "App keeps sync with WMS with optimal resource usage \n\nInformation is 100% accurate \n\nAll key features are complete ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nProgramming, Mobile development (android/ios) \n\n \n\nPreferable: \n\nExperience with React Native and integrating with systems API ",
   "Project Description": "Deskimo.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Oscar Lopez Alegre",
   "Position": "CEO",
   "Email": ""
 },
 {
   "No": 24,
   "Company": "Nextway Technology",
   "Project Title": "Chaos Creatures – Generative AI card game  ",
   "Project Introduction": "Are you interested in developing a cutting-edge mobile game that will take the gaming world by storm? Our project is focused on creating an Android/iOS game that is a simplified version of popular card games like Yugioh and Magic the Gathering. \n\nBut that's not all - we're incorporating the latest technology into our game development process. We'll be using generative AI to create the interface for the cards, as well as generate unique descriptions for each card using the state-of-the-art Chat GPT language model. \n\nBut we're not stopping there - we're also using generative AI to create original music for the game using a Music LM. This means the game will have its own original soundtrack, tailored to match the excitement and intensity of each match. \n\nThis is a great opportunity to work on a project that is both cutting-edge and fun. You'll get hands-on experience with the latest AI technology and game development techniques, while working on a game that could potentially reach millions of players. Join us and let's create something amazing together! \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n2 days per week in the office ",
   "Project Outcomes & Deliverables": "\n\nDeliver a mobile game for iOS and Android platforms, featuring a campaign mode with over 300 cards for players to collect and manage in their decks.  \n\nInclude a multiplayer feature with a ranking system, allowing players to compete online. \n\nA currency system for purchasing card packs to acquire new and powerful cards. ",
   "Project Success Criteria": "Our team will consider successful once we have created a fully functional campaign mode for the game that includes at least 300 unique cards for players to collect and manage in their decks. This mode should be engaging, fun, and offer a satisfying gaming experience to players. ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nProgramming, Mobile development (android/ios) \n\n \n\nPreferable: \n\nSoftware Engineering skills, Cross platform mobile development OR android & iOS development, Experience with coding with game engine, specially any experience with Godot or Unity \n\n \n\nIdeal: \n\nInterest in game design and card games. Interested on AI ",
   "Project Description": "Nextway Technology No. 1 - Chaos Creatures.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Oscar Lopez Alegre",
   "Position": "CEO",
   "Email": ""
 },
 {
   "No": 25,
   "Company": "Nextway Technology",
   "Project Title": "MealMaster ",
   "Project Introduction": "In most of the restaurant meal ordering is relying on the interaction with waiters to place order into the kitchen. In busy hours of restaurant this coordination is a challenge result in un-satisfaction to the customer. \n\nWe want to build up a good platform to increase the customer satisfaction via simplify the operation process in food ordering on premium restaurant. \n\nWe will focus to deliver mobile app (Android/iOS) for Customer and Back Office for restaurant owner.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n2 days per week in the office",
   "Project Outcomes & Deliverables": "\n\nDeliver UI/UX \n\nDeliver Mobile applications (Android/iOS) \n\nDeliver Back Office ",
   "Project Success Criteria": "\n\nDeliver UI/UX \n\nDeliver Mobile applications (Android/iOS) \n\nDeliver Back Office ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nWeb Framework: NestJS https://nestjs.com/ \n\nMobile: React Native https://reactnative.dev/ \n\nDesign: Figma \n\nDatabase: MySQL \n\nFirse ",
   "Project Description": "Nextway Technology No.2_MealMaster_Proposal.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Oscar Lopez Alegre",
   "Position": "CEO",
   "Email": ""
 },
 {
   "No": 26,
   "Company": "Nextway Technology",
   "Project Title": "BeautyX ",
   "Project Introduction": "People like to get things done without putting much effort. Whether it be food or groceries, people nowadays want most products and services delivered right at their doorsteps. \n\nWith beauty app, we proved the best services to Customer to enjoy the beauty services (Such as in terms of haircut, makeup…) with the convenience steps.  \n\nNot only that, we help the beauty salon owner can optimize their operation, save cost and increase the revenue via organic traffic from our application. \n\nWe will focus to deliver mobile app (Android/iOS) for Customer and Back Office for Beauty Salon owner. \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ \n2 days per week in the office ",
   "Project Outcomes & Deliverables": "\n\nDeliver UI/UX \n\nDeliver Mobile applications (Android/iOS) \n\nDeliver Back Office ",
   "Project Success Criteria": "\n\nDeliver UI/UX \n\nDeliver Mobile applications (Android/iOS) \n\nDeliver Back Office ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nWeb Framework: NestJS https://nestjs.com/ \n\nMobile: React Native https://reactnative.dev/ \n\nDesign: Figma \n\nDatabase: MySQL \n\nFirse ",
   "Project Description": "Nextway Technology No.3_BeautyX_Proposal.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Oscar Lopez Alegre",
   "Position": "CEO",
   "Email": ""
 },
 {
   "No": 27,
   "Company": "GTEL",
   "Project Title": "Private cloud solution for high availability and scalability ",
   "Project Introduction": "Cloud computing has revolutionized the way businesses and individuals use and access technology. The development of cloud computing can be traced back to the 1950s, when mainframe computers were first introduced. These early computers were large and expensive, and they were primarily used by large organizations like governments and research institutions. However, as technology advanced and the demand for computing power grew, the need for more affordable and accessible computing solutions emerged. \nThe development of cloud computing has been driven by the need for more flexible, scalable, and cost-effective computing solutions. Cloud computing offers businesses the ability to rapidly scale up or down their computing resources based on demand, without the need for large investments in hardware and infrastructure. It also allows businesses to access a wide range of software and services over the internet, reducing the need for on-premise installations. \nToday, cloud computing has become an essential part of the technology landscape, with businesses of all sizes relying on it to power their operations. The development of cloud computing has enabled a new era of innovation and productivity, and it is expected to continue to evolve and shape the future of technology. \nDespite its advantages, public cloud has some major problems to be used widely in governmental agencies, instead private cloud is more favorable.  \n\nSecurity: With a private cloud, the organization has complete control over the security of their data and can implement customized security protocols to meet their specific needs. \nCompliance: Organizations in highly regulated industries, such as healthcare and finance, may need a private cloud to ensure they are in compliance with industry regulations. \nCustomization: A private cloud can be customized to meet the specific needs of an organization, including the ability to integrate with existing systems and applications. \nCost: While a private cloud can require a significant upfront investment, it can also save money in the long run by allowing the organization to optimize their resources and reduce IT costs. \nPerformance: A private cloud can provide higher levels of performance and availability compared to public cloud environments, especially for applications that require a high level of processing power or data transfer speeds. \nTo support its customer, GTel wants to build a cloud infrastructure that could take all the advantages of public cloud like AWS, Azure but maintains its as a private infrastructure. \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "Students take part in this project need to study, experience, and prototype a private infrastructure as a service cloud system that could be installed within Vietnam at GTel or its partners data centers. Ideally, the prototype could demonstrate the following capabilities: \n\nHigh Availability: \n\nAll the networks, computing, storage, and database resources should allow high availability through multi-zones implementation (like in AWS), i.e, one city with have 3 data centres to distribute data.  \n\nScalability: \n\nScaling of computing resources and database should be done with minimal efforts. Scaling should be triggered by multiple flexible metrics such as CPU usage, RAM usage etc. There should be load balancers. \n\nStorage: \n\nThere should be a reliable, cheap and flexible storage similar like S3 and EBS in AWS which allows up to 99.99999999999 (11 digits) of reliability.  \n\nTo implement this, there are some options: \n\n- Consider solutions from VMWare such as VCloud Director \n\n- Consider to use open source stack such as localstack from AWS, serverless framework, openstack etc.  \n\n- Consider to implement a solution from scratch based on Hypervisor provided by VMWare or other cloud providers.  ",
   "Project Success Criteria": "Some metrics to measure the success of the project: \n\nThe system should demonstrate high availability with up to 99.999 up time \n\nThe system should demonstrate the scalability with unlimited scale and boot time for new nodes should be less than 3 minutes \n\nThe system should allow automatic scaling with command line and scripting file.  ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nAWS, Linux, Dev/Ops.  \n\n\nPreferable: \n\nPreferable students with Cloud minors, Dev/Ops interests \n\n \nIdeal: \n\nExperienced with cloud, hypervisor, localstack, Dev/Ops process ",
   "Project Description": "Gtel No 1._PrivateCloud4HighAvailability.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Bùi Tuan Anh",
   "Position": "Vice Director",
   "Email": ""
 },
 {
   "No": 28,
   "Company": "GTEL",
   "Project Title": "Develop AI Camera system for traffic control ",
   "Project Introduction": "Recently, AI has penetrated into all areas of life. To take its advantages, Vietnam Traffic Police intends to build a smart camera system to improve its efficiency. \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "The project aims to have a minimal prototype that could show proof of concept which set the base for future enhancement. The prototype should provide some of following features:  \n\nTraffic monitoring and analysis: AI cameras can be installed at intersections and other traffic points to monitor traffic flow, detect accidents, and identify traffic violations such as running red lights, illegal U-turns, and speeding. The data from these cameras can be analyzed to optimize traffic flow and reduce congestion. \n\nSmart traffic signal control: AI cameras can be used to feed data into traffic signal control systems to optimize traffic signal timings. The system can detect the number of vehicles at an intersection and adjust signal timings accordingly to reduce wait times and increase traffic flow. \n\nPedestrian safety: AI cameras can be used to detect pedestrians at crosswalks and activate traffic signals accordingly. The system can also detect pedestrians who are jaywalking or crossing the road illegally and alert authorities to take action. \n\nEmergency vehicle detection: AI cameras can be used to detect emergency vehicles such as ambulances and fire trucks and automatically adjust traffic signals to allow them to pass quickly and safely. \n\nLicense plate recognition: AI cameras can be used to capture license plate numbers of vehicles passing by and cross-check them with a database of stolen or wanted vehicles. This can help law enforcement to quickly identify and track down suspects and stolen vehicles. \n\nFacial recognition: AI cameras can be used to capture facial images of drivers and passengers of vehicles passing by and cross-check them with a database of suspects and wanted individuals. This can help law enforcement to identify and track down suspects and criminals. \n\nReal-time crime detection: AI cameras can be used to detect suspicious behavior and alert authorities in real-time. For example, the system can detect a person breaking into a car or a group of people loitering in a parking lot and alert authorities to take action. \n\nCrime scene investigation: AI cameras can be used to capture high-resolution images of crime scenes and collect evidence. The images can be analyzed by AI algorithms to identify potential suspects or witnesses and provide additional evidence for investigations. ",
   "Project Success Criteria": "Some metrics to measure the success of the project \n\nAccuracy of plate recognition 95-97% \n\nAccuracy of crime detection: >80% \n\nAccuracy of emergency vehicle detection >90% ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nMachine Learning, Web Programming \n\n \nPreferable: \n\nComputer vision  \n\n \nIdeal: \n\nMachine Learning, Web Programming, Computer vision experience ",
   "Project Description": "Gtel No.2_AICamera4Traffic.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "Y",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Bùi Tuan Anh",
   "Position": "Vice Director",
   "Email": ""
 },
 {
   "No": 29,
   "Company": "Katalon",
   "Project Title": "ML-based test result analysis to improve automation testing.",
   "Project Introduction": "Automated testing has become an essential part of software development, as it allows developers to quickly and\nefficiently identify defects and other issues. However, managing and analyzing the results of automated tests\ncan be a challenge, particularly as the scale and complexity of software projects increase.\nThis project aims to address this challenge by developing an ML-based test result analysis system that can help\nidentify patterns and anomalies in automated test results, making it easier for developers and testers to address\nissues and improve the overall effectiveness of their automated testing.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "1. Project plan\n2. ML algorithms\n3. Visualization dashboard\n4. Project showcase or Final presentation",
   "Project Success Criteria": "1. Improved efficiency and effectiveness of automated testing.\n2. Improved identification and resolution of issues and defects.\n3. Increased developer productivity and reduced development time.",
   "Technical and Professional Competencies & Skills required": "Required:\n● Product management\n● Project management\n● Data analysis\n● Software design\n● Machine learning\n● Web development\n\nPreferable:\n● Software testing\n● Cloud computing\n● Distributed computing",
   "Project Description": "2023 I Katalon I Project proposal I ML-based test result analysis to improve automation testing.docx.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Nhung Nguyen (Ms.)",
   "Position": "Comms Speialist",
   "Email": ""
 },
 {
   "No": 30,
   "Company": "NFQ",
   "Project Title": "Build a Chatbot for car rental system in Hawaii\n",
   "Project Introduction": "We have a car system rental website and application. The existing car rental system is relying\non a manual support service to assist customers with their inquiries such as car availability,\npricing, booking and answering general questions related to the rental service. However, as the\nnumber of customers increases, the support service may struggle to keep up with the demand,\nleading to long wait times and delayed responses, which could negatively impact customer\nsatisfaction.\nTo address this challenge, the car rental company wants to transform its manual support service\ninto a chatbox service that can handle customer inquiries in an automated and efficient way. The\nchatbot will be integrated into Facebook's company, and customers can interact with it using\nnatural language to get real-time responses to their inquiries and even proceed with their car\nbooking. One such platform could be a chatbot based on the ChatGPT model or Amazon Lex or\nother AI Chatbot models.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ ",
   "Project Outcomes & Deliverables": "Project plan: A detailed project plan that outlines the timeline,tasks and resources\nrequired for the transformation process\n● Chatbot design: The architecture of the Chatbot including the integration of the AI\nChatbot model, the chatbot’s conversation flow and the user interface.\n● Chatbot development: The actual development of the chatbot\n● Training data preparation: A process of collecting and cleaning data to train AI Chatbot\non specific domain knowledge such as car rental systems and relevant topics\n● Chatbot training and testing: The actual training of AI Chatbot on the car rental domain\nand evaluating its performance using various metrics, such as accuracy and response\ntime.\n● Integrate with systems: The integration of chatbot with Facebook and the back-end\nsystem with the database (we will provide our database structure and some statistics).\nNice to have:\n● Training materials: Documentation the user guide that explains how to use the chatbox\n● Multilingual support: Developing the chatbot to support multiple languages to cater to\ncustomers from different regions (VN and EN)\n● Analytics and reporting: A reporting module that provides real-time analytics on\nchatbot usage. This could help the car rental company to track the success of the\nchatbot and make data-driven decisions about future improvements\n● Security and privacy measures: Ensuring that the chatbot complies with all necessary\nsecurity and privacy regulations, such as GDPR or CCPA and implementing necessary\nmeasures to safeguard customer data.",
   "Project Success Criteria": "● Chatbot accuracy: The chatbot should be able to understand and respond accurately to\na variety of user inputs related to the car rental and should have a high accuracy rate in\nunderstanding the user’s intent and providing appropriate responses.\n● Natural Language Processing (NLP) capabilities: The chatbox should be able to\nunderstand and interpret natural language, including synonyms and variations in\nwording, and should be able to respond with appropriate language and tone.\n● Integration with car rental system: The chatbot should be integrated with Facebook\nand the existing car rental system, allowing users to view available cars, make\nreservations and access account information.\nNice to have\n● Automation Test: Apply the Unit Test to the source code\n● Apply CI/CD: The pull request will be automatically tested before merged and will auto\ndeployed to the Testing environment after merged\n● Security: The chatbot should be designer with strong security features to protect user\ndata, including user authentication and secure data transfer\n● Analytics and reporting: The chatbot should be able to provide analytics and reporting\non user interactions, allowing for continuous improvement of the chatbot’s performance\nand user satisfaction",
   "Technical and Professional Competencies & Skills required": "● Programming languages: Python, PHP, Java, JavaScript or other back-end languages\n● Understanding of Natural Language Processing (NLP)\n● Machine learning\n● API development and integration\n● Chatbot development frameworks\n● Know about Agile / Scrum methodology",
   "Project Description": "NFQ No 1._ Chatbot - Car rental Hawaii.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Mr Timmy Nguyen",
   "Position": "Brand Manager",
   "Email": ""
 },
 {
   "No": 32,
   "Company": "NFQ",
   "Project Title": "Health Symptom App Checker ",
   "Project Introduction": "Background: Many people experience health symptoms at various points in their lives, but may \nnot always know what these symptoms indicate or how to get the help they need. Health \nSymptom App Checker was created to provide a user-friendly and accessible tool for people to \ninput their symptoms and receive information about potential diagnoses.\nHealth Symptom App Checker is based on a database of diseases and conditions, and uses \nalgorithms to match users' symptoms with potential diagnoses. The app also includes additional \nfeatures such as descriptions of each condition, risk assessment tools, emergency contact \ninformation, and health tracking tools to help users manage their health over time.\nHealth Symptom App Checker is designed for people of all ages and backgrounds who are \nlooking for a reliable and easy-to-use tool to help them understand their health symptoms. \nWhether a user is experiencing mild or severe symptoms, Health Symptom App Checker aims \nto provide accurate information and support to help users make informed decisions about their \nhealth.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☒​  NO ​☐​ ",
   "Project Outcomes & Deliverables": "Health Symptom App Checker is a mobile application designed to help users identify potential \ndiseases or conditions based on their symptoms. By providing users with a list of possible \ndiagnoses, Health Symptom App Checker aims to help users make informed decisions about \ntheir health and seek appropriate medical care when necessary.\n• Symptom checker: The primary feature of your app will likely be a symptom checker \nthat allows users to input their symptoms and receive a list of potential diseases or \nconditions. This feature should be user-friendly and easy to navigate, with clear \ninstructions on how to input symptoms.\n• Condition descriptions: For each condition that is listed as a potential match, you may \nwant to include a brief description of the condition, along with common symptoms and \ntreatment options. This can help users better understand their potential diagnosis and \nmake informed decisions about their health.\n• Risk assessment: Depending on the type of symptoms that are inputted, your app may \nwant to include a risk assessment feature that calculates the likelihood of certain \nconditions based on various factors such as age, gender, and medical history.\n• User profiles: Users may want to create profiles within the app that store their personal \nhealth information, such as medical history and medication lists. This can help users \nkeep track of their health information and share it easily with medical professionals.\nNFQ x RMIT - Capstone Project, Date: February 23rd, 2023\nThis document is strictly private, confidential, and personal to its recipients and should not be copied, distributed, or \nreproduced in whole or in part, nor passed to any third party.\nDevice priority:\n• Primary: Smartphone users\n• Secondary: Tablet users\n• Tertiary: Desktop users\n",
   "Project Success Criteria": "Symptom checker\n• Accuracy: The symptom checker should provide accurate results to users. This means that the app should correctly identify potential diagnoses based on the symptoms entered by the user.\n• Speed: The symptom checker should provide results quickly, ideally within seconds of the user entering their symptoms.\nCondition descriptions\n• Clarity: The descriptions should be clear and easy to understand, using language that is accessible to a wide range of users.\n• Accuracy: The information provided should be accurate and up-to-date, based on reputable medical sources.\n• Relevance: The descriptions should be relevant to the user's condition and symptoms, providing information that is specific to their needs.\n• Completeness: The descriptions should be comprehensive, covering all relevant information about the condition, including common symptoms, causes, treatment options, and potential complications.\n• User engagement: The descriptions should be engaging and interactive, using multimedia such as images and videos to help users better understand the condition.\nRisk assessment\n• Accuracy: The risk assessment tool should accurately predict a user's risk of developing a certain health condition based on their inputted information.\n• Validity: The risk assessment tool should be based on validated medical research and guidelines, and should have undergone rigorous testing to ensure its effectiveness.\n• Usability: The risk assessment tool should be easy to use and understand, with clear instructions and an intuitive interface.\n• Actionability: The risk assessment tool should provide users with actionable recommendations based on their risk level, such as advice on lifestyle changes or recommendations for medical follow-up.\nUser profiles\n• User control: Users should be able to create and manage their own profiles, with the ability to add, edit, or remove information as needed.\n• Relevance: User profiles should contain relevant information that can be used to provide personalized health recommendations or treatment plans.\n• Integration with other features: User profiles should be integrated with other features of the app, such as the symptom checker and risk assessment tool, to provide users with a more personalized and comprehensive health experience.\n• Accuracy: The information provided in user profiles should be accurate and up-to-date, reflecting users' current health status and needs.\n",
   "Technical and Professional Competencies & Skills required": "Required:\n• Web Development: Developers should have experience in web development \ntechnologies such as HTML, CSS, JavaScript and front-end frameworks such as React, Vue.js, or Angular to create a user-friendly interface for the health care application.\n• Programming Languages (such as Python, Java, and C/C++): Developers should be proficient in programming languages such as Python, Java, and C/C++ to develop the various components of the application.\n• Database design and management: knowledge of database technologies such as SQL or NoSQL, and experience with data modeling, database design, and management tools like MongoDB or PostgreSQL or MySQL, …\n• Machine Learning: Developers should have a strong understanding of machine learning concepts and techniques to develop an accurate and effective symptom checker and risk assessment tool.\n• Data Science: Developers should have a solid understanding of data science and analytics to collect and analyze user data, and to provide personalized health recommendations.\n• Android/iOS Development: Developers should have experience in mobile app \ndevelopment (Kotlin, Java, Swift, Objective C, Flutter, React Native) to create an Android/iOS version of the health care application, allowing users to access the app from their mobile devices.\nPreferable:\n• Cloud-Based Services: Developers should be familiar with cloud-based services and technologies such as Amazon Web Services (AWS) or Microsoft Azure or Google Cloud to ensure the application can handle large amounts of data and traffic.\n• Networking: Developers should have a solid understanding of networking principles to ensure the application can communicate with external systems and services.\n• DevOps and Automation: Developers should be familiar with DevOps practices and automation tools such as Jenkins and Ansible to ensure that the application can be built, tested, and deployed quickly and efficiently.",
   "Project Description": "NFQ No.3 - Health Symptom App Checker - 230223.pdf",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "N",
   "Supervisor Name": "Mr Timmy Nguyen",
   "Position": "Brand Manager",
   "Email": ""
 },
 {
   "No": 33,
   "Company": "The Business School (SBM), RMIT VN",
   "Project Title": "Macroeconomics game simulation: SimGlobe",
   "Project Introduction": "This project will create a web-based, multiplayer application that will give economic students the possibility to simulate the management of a country, adjusting 5 parameters during 8 rounds/years with the aim to achieve highest approval rating from their population. During round 2 to 7 the students will be challenged with a random event to which they will have to respond by choosing policies from a choice of 3 different policies. The student groups can choose among 50 real countries to manage. \nThis application intends to enrich the learning experience of students, using a rich wealth of traditional, textbook economic theories as underlying basis for the mechanic, which the student will need to understand in order to be successful. \nGamification in higher education has become increasingly relevant due to the pandemic online learning as well as a more successful didactical technique for GenZ and GenA students, where many traditional learning methods have become obsolete. According to some studied, gamification increased student performance by 89% in some cases (Heriott-Watt University, 2022, https://mobile-magazine.com/articles/gamifications-role-in-the-future-of-online-learning) Unfortunately, games that use a multitude of theoretical grounded applications embedded are extremely rare in economics. This game mechanics and design would improve the current standard of existing games manifold and could easily become a reference for the industry, generating additional income to RMIT.\n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "1.        Translate the mechanics of the game from its current excel form into a web-based application\n2.        Code the mechanics for multiplayer (up to 50 players), where the keyed in information of each player feeds into the game and has an impact on other players.\n3.        Implement  six “events” that will challenge the player each period, each paired with 3 policy implications to respond to this event, of which the player will need to choose none, one or two, but cannot chose all three. \n4.        Code each round’s rankings and final winner.\n5.        Prepare the coding to be delivered to Game Department RMIT Melbourne.\n6.        Deadline mid-June 2023.\n7.        Be available for follow-up consultations of Game Department from June to October 2023.\n8.        Be available for patches from October to December 2023.\n",
   "Project Success Criteria": "\n1.        A complete game system supporting simultaneously multiplayers is ready and playable \n2.        No critical and major bugs, less than 5 minor bugs\n3.        Response time less than 3 seconds\n4.        Allows up to 1000 teams playing at the same time. \n5.        Highly configurable inputs params and formulars\n",
   "Technical and Professional Competencies & Skills required": "Required:\nProgramming skills/Development of web-based application, cloud/server programming.\n\nPreferable:\nReactJS, NodeJS, MongoDB, NestJS, JWT, Server push, Web socket, Notifications, Pub/sub\n\nIdeal:\nExperienced with web development, gamification\n",
   "Project Description": "TBS RMIT VN_SimGlobe_v2.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Dr. Daniel Borer",
   "Position": "Project Lead",
   "Email": ""
 },
 {
   "No": 34,
   "Company": "L&T Department, RMIT VN",
   "Project Title": "RMIT University Vietnam Design for Learning tool  ",
   "Project Introduction": "RMIT University Vietnam is committed to providing transformational learning experiences.  Our faculty are, without exception, experts in their fields.  This project is intended to help support them deliver that expertise to their students (you and your friends) in active, engaging, and interesting ways.  We want to develop a course and lesson planner that helps lecturers plan and deliver world-class learning experiences that make use of the latest learning and teaching ideas and educational technologies.   \n\nThe main tasks are as follows:  \n\nDevelop an interactive course and lesson planner with a WYSIWYG interface \n\nDevelop sharing and collaboration options for course and lesson plans \n\nDevelop analytics capacities across courses and lessons (i.e., tracking frequency and duration of a certain type of feature within a course) \n\nDevelop a html code generator that will export valid code based on the inputs for export into Canvas \n\nAre students required to work on-site (at company office, design center, manufacturing plants, etc.)? YES ​☐​  NO ​☒​",
   "Project Outcomes & Deliverables": "As following \n\nDevelop a flexible course and lesson planner which references Laurillard’s learning and teaching events (does this basically) \n\nAllows users to plan blended learning sequences capturing a range of variables (online/face-to-face, synchronous/asynchronous learning, pre-class/in-class/post-class, etc.) \n\nHas the ability to create or select and use pre-set patterns for particular delivery approaches \n\nIncludes a range of reference material (i.e.videos, text, and interactives that we will provide),  on different learning/teaching approaches and tools \n\nDevelop export and sharing options for course and lesson plans  \n\nDevelop analytics capacities across courses and lessons (i.e., tracking frequency and duration of a different features across a lesson and within a course) \n\nhtml code generator that can export valid html that can then be pasted into Canvas \n\n\nStretch targets:  \n\nVersion controls and shared libraries of content \n\nAbility to collaborate and annotate on lesson and course to allow for improvements to be made over time  ",
   "Project Success Criteria": "\n\nDevelop a flexible course and lesson planner which references Laurillard’s learning and teaching events (does this basically) \n\nAllows users to plan blended learning sequences capturing a range of variables (online/face-to-face, synchronous/asynchronous learning, pre-class/in-class/post-class, etc.) \n\nHas the ability to create or select and use pre-set patterns for particular delivery approaches \n\nIncludes a range of reference material (i.e., videos, text, and interactives that we will provide) on different learning/teaching approaches and tools \n\nIncorporate the ability for users to share, edit, and save course and lesson plans to their own respective accounts \n\nDevelop analytics capacities across courses and lessons (i.e., tracking frequency and duration of a different features across a lesson and within a course) \n\nDevelop an html code generator that can export valid html based on the course/lesson plan that can then be pasted into Canvas ",
   "Technical and Professional Competencies & Skills required": "Required: \n\nMySQL or any relational database system \n\nGIT \n\nReactJS/VueJS \n\n \n\nPreferable: \n\nSoftware Engineering skills \n\nWebsite development experience would be useful for developing the interface \n\nActive communication skills \n\nDesign expertise would be great but not essential – though support can be offered regarding this if that is required. ",
   "Project Description": "L&T Department, RMIT VN.docx",
   "Academic Background": "BH120, BP162",
   "Student #": 4,
   "Interview required?": "N",
   "Multi teams allowed?": "Y",
   "Supervisor Name": "Nick McIntosh",
   "Position": "Project Lead",
   "Email": ""
 }
]